{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "<|endoftext|>",
  "eos_token": "<|endoftext|>",
  "errors": "replace",
  "extra_special_tokens": [
    "<|fim_prefix|>",
    "<|fim_middle|>",
    "<|fim_suffix|>",
    "<|fim_pad|>",
    "<|filename|>",
    "<|gh_stars|>",
    "<|issue_start|>",
    "<|issue_comment|>",
    "<|issue_closed|>",
    "<|jupyter_start|>",
    "<|jupyter_text|>",
    "<|jupyter_code|>",
    "<|jupyter_output|>",
    "<|empty_output|>",
    "<|commit_before|>",
    "<|commit_msg|>",
    "<|commit_after|>",
    "<|reponame|>",
    "<|im_start|>",
    "<|im_end|><|vision_start|>",
    "<|vision_end|>",
    "<|image_pad|>",
    "<|video_pad|>",
    "<|tool_start|>",
    "<|tool_end|>",
    "<|tool_response_start|>",
    "<|tool_response_end|>",
    "<|action_start|>",
    "<|action_end|>",
    "<|reserved_token_0|>",
    "<|reserved_token_1|>",
    "<|reserved_token_2|>",
    "<|reserved_token_3|>",
    "<|reserved_token_4|>",
    "<|reserved_token_5|>",
    "<|reserved_token_6|>",
    "<|reserved_token_7|>",
    "<|reserved_token_8|>",
    "<|reserved_token_9|>",
    "<|reserved_token_10|>",
    "<|reserved_token_11|>",
    "<|reserved_token_12|>",
    "<|reserved_token_13|>",
    "<|reserved_token_14|>",
    "<|reserved_token_15|>",
    "<|reserved_token_16|>",
    "<|reserved_token_17|>",
    "<|reserved_token_18|>",
    "<|reserved_token_19|>",
    "<|reserved_token_20|>",
    "<|reserved_token_21|>",
    "<|reserved_token_22|>",
    "<|reserved_token_23|>",
    "<|reserved_token_24|>",
    "<|reserved_token_25|>",
    "<|reserved_token_26|>",
    "<|reserved_token_27|>",
    "<|reserved_token_28|>",
    "<|reserved_token_29|>",
    "<|reserved_token_30|>",
    "<|reserved_token_31|>",
    "<|reserved_token_32|>",
    "<|reserved_token_33|>",
    "<|reserved_token_34|>"
  ],
  "is_local": true,
  "local_files_only": false,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": null,
  "tokenizer_class": "GPT2Tokenizer",
  "unk_token": "<|endoftext|>",
  "vocab_size": 49152
}
